<a href="https://colab.research.google.com/github/mousekim/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_1_~_6_(2020_07_28).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**1) 팬더스, 데이터프레임, 시리즈 알아보기**

In [7]:
import pandas as pd #pandas는 파이썬 라이브러리로써, 여기서 pandas는 pd로 씀

In [ ]:
data_frame = pd.read_csv('data/friend_list.csv') #data_frame이라는 변수에 csv파일을 불러오기 위해 ps.read_cav 함수를 사용함
data_frame

In [ ]:
data_frame.head[2] #앞에 있는 2개만 불러옴

In [ ]:
data_frame.tail[2] #뒤에 있는 2개만 불러옴

In [ ]:
type[data_frame.name] #colume들의 데이터타입은 series임 (데이터프레임은 시리즈의 결합체 )

In [11]:
list_tmp = [1,2,3] #시리즈는 파이썬 리스트로 만들 수 있음
list_tmp

[1, 2, 3]

In [14]:
s1 = pd.core.series.Series([1,2,3]) #시리즈 만들기 (1)
s2 = pd.core.series.Series(['one', 'two', 'three']) #시리즈 만들기 (2)

pd.DataFrame(data=dict(num=s1, word=s2)) #데이터프레임 만들기 (num에 s1, word에 s2)

   num   word
0    1    one
1    2    two
2    3  three




**2) 파일에서 데이터 불러오기**

In [16]:
import pandas as pd #pandas를 앞으로 pd로 표현함

In [ ]:
df = pd.read_csv('data/friend_list.csv') #변수 df에 pd.read_csv 기능을 활용하여 데이터를 불러옴
df

In [ ]:
df.head() #처음부터 5개까지의 데이터를 보여줌

In [ ]:
df.tail(3) #뒤에서부터 3개까지의 데이터를 보여줌

In [ ]:
df = pd.read_csv('data/friend_list.txt') #변수 df에 pd.read_csv 기능을 활용하여 데이터를 불러옴
df #이 때 데이터는 콤마(,)로 구분됨

In [ ]:
df = pd.read_csv('data/friend_list_tab.txt') #변수 df에 pd.read_csv 기능을 활용하여 데이터를 불러옴
df #이 때 데이터는 tab으로 구분됨

In [ ]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t') #,가 아닌 tab로 구분되어있다는 것을 나타내는 코드
df #이 때 데이터는 tab으로 구분됨

In [ ]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None) #헤더가 없다고 표현하는 방법
df

#colume에 정보가 없기 때문에 0, 1, 2 index로 표현됨

In [ ]:
df.columns = ['name', 'age', 'job']
df

#헤더 정보(첫 번째 행의 이름)를 colume에 추가하면 name, age, job가 헤더에 추가됨

In [ ]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
df

#한 줄로 헤더 이름이 없던 데이터를 헤더 이름을 주며 데이터프레임을 생성하는 방법

**3) 데이터프레임 생성하기**

In [ ]:
import pandas as pd #pandas를 앞으로 pd로 표현함

In [22]:
#딕셔너리를 가지고 있는 리스트로 데이터프레임을 생성하는 예제

friend_dict_list = [
    {'name': 'John', 'age': 25, 'job': 'student'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friend_dict_list) #pd.DataFrame 인자로 위 리스트를 넣어줌
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [23]:
#colume 이름에 순서를 지정해주는 방법

df = df[['name', 'job', 'age']] #name, job, age 순서대로 데이터를 지정해줌
df.head()

   name      job  age
0  John  student   25
1  Nate  teacher   30

In [24]:
#orderedDictionary를 활용하여 한번에 순서를 지정해주는 방법 + 예제

from collections import OrderedDict #OrderedDictionary 사용하기 위해 import하기

friend_ordered_dict = OrderedDict(
    [
     ('name', ['John', 'Nate']),
     ('age', [25, 30]),
     ('job', ['student', 'teacher'])
    ]
)

df = pd.DataFrame.from_dict(friend_ordered_dict) #pd.DataFrame.from_dict 인자로 위 딕셔너리를 넣어줌
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [25]:
#리스트를 활용하여 데이터프레임을 만드는 예제

friend_list = [
     ['John', 20, 'student'],
     ['Nate', 30, 'teacher']
] 

column_name = ['name', 'age', 'job']

df = pd.DataFrame.from_records(friend_list, columns = column_name) #두 리스트(데이터)를 활용하여 데이터프레임 만드는데, 이 때 friend_list, column_name을 인자로 넣어줌
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [28]:
#column 헤더를 작성하지 않고 한번에 데이터프레임을 만드는 방법 + 예제

from collections import OrderedDict

friend_list = [
     ['name', ['John', 'Nate', 'Tom']],
     ['age', [20, 30, 25]],
     ['job', ['student', 'teacher', 'worker']]
] 

df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher
2   Tom   25   worker

**4) 데이터프레임 파일로 저장하기(to_csv)**

In [2]:
import pandas as pd #pandas를 pd로 표현함

friends = [{'name': 'Jone', 'age': 20, 'job': 'student'},
          {'name': 'Jenny', 'age': 30, 'job': None},
          {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']] #데이터프레임 생성하기
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [3]:
#위 데이터프레임을 csv 파일로 저장하는 방법

df.to_csv('friends.csv')

In [4]:
#row 아이디를 생략하는 방법

df.to_csv('friends.csv', index = False, header = True)

In [5]:
#row, column 값을 모두 생략하는 방법

df.to_csv('friends.csv', index = False, header = False)

In [7]:
#None값을 빈칸 대신 다른 것으로 표현하는 방법

df.to_csv('friends.csv', index = False, header = False, na_rep = '-')

**5) 데이터프레임 행, 열(row, column) 선택 및 필터 하기**

In [28]:
import pandas as pd #pandas를 pd로 표현함
from collections import OrderedDict

friend_list = [
               ['name', ['John', 'Jenny', 'Nate']],
               ['age', [20, 30, 30]],
               ['job', ['student', 'developer', 'teacher']]
]

df = pd.DataFrame.from_dict(OrderedDict(friend_list))  #데이터프레임 생성하기
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [29]:
#원하는 데이터만 select하는 방법

df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [30]:
#불연속적으로 원하는 데이터를 select하는 방법

df.loc[ [0,2] ]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [31]:
#column의 condition에 따라 row를 선택하는 방법(1)

#by coolumn condition

df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [32]:
#column의 condition에 따라 row를 선택하는 방법(2)

df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [33]:
#column의 condition에 따라 row를 선택하는 방법(3)

df[ (df.age>25) & (df.name == 'Nate') ]

   name  age      job
2  Nate   30  teacher

In [36]:
#filter column
#index로 필터하는 방법

friend_list = [
        ['John', 20, 'student'],
        ['Jenny', 30, 'developer'],
        ['Nate', 30, 'teacher']
]

df = pd.DataFrame.from_records(friend_list) #데이터프레임 생성하기
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [37]:
#column을 필터하는 방법(1)

df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [38]:
#column을 필터하는 방법(2)

df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [ ]:
#column을 필터하는 방법(3)

#by column name

df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

df_filtered = df[['name', 'age']] #name, age 외에는 필터링하기
df_filtered

In [ ]:
df.filter(items=['age', 'job']) #filter를 활용하면 효율적으로 필터할 수 있음

In [ ]:
#filter를 활용한 예제(1)

df.filter(like='a', axis = 1) #a만 있는 것을 필터하는 방법

In [ ]:
#filter를 활용한 예제(2)

df.filter(regex='b$', axis=1) #b만 있는 것을 필터하는 방법

**6) 데이터프레임 행, 열(drop row, column) 삭제하기**

In [12]:
import pandas as pd #pandas를 pd로 표현함

friends = [{'age': 20, 'job': 'student'},
          {'age': 25, 'job': 'developer'},
          {'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job']) #데이터프레임 생성하기

df

       age        job
John    20    student
Jenny   25  developer
Nate    30    teacher

In [13]:
#데이터프레임에서 데이터를 삭제하는 방법

df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [14]:
#데이터프레임에서 영구적으로 데이터를 삭제하는 방법

df = df.drop(['John', 'Nate'])
df

       age        job
Jenny   25  developer

In [18]:
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job']) #데이터프레임 생성하기

df

       age        job
John    20    student
Jenny   25  developer
Nate    30    teacher

In [19]:
#inplace 명령어를 활용하여 표현하기

df = df.drop(['John', 'Nate'], inplace = True) #따로 assign 할 필요가 없음
df

In [20]:
friends = [{'name': 'John', 'age': 20, 'job': 'student'},
          {'name': 'Ben', 'age': 25, 'job': 'developer'},
          {'name': 'Jenny', 'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job']) #데이터프레임 생성하기
df

    name  age        job
0   John   20    student
1    Ben   25  developer
2  Jenny   30    teacher

In [21]:
#index를 활용하여 데이터를 삭제하는 방법

df = df.drop(df.index[[0, 2]])
df

  name  age        job
1  Ben   25  developer

In [22]:
df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job']) #데이터프레임 생성하기
df

    name  age        job
0   John   20    student
1    Ben   25  developer
2  Jenny   30    teacher

In [23]:
#조건을 활용하여 데이터를 삭제하는 방법

df = df[df.age > 20]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [25]:
df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job']) #데이터프레임 생성하기
df

    name  age        job
0   John   20    student
1    Ben   25  developer
2  Jenny   30    teacher

In [26]:
#column을 활용하여 데이터를 삭제하는 방법

df = df.drop('age', axis = 1) #axis = 1은 column 중에서를 의미함
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher